# Ref: https://github.com/Homebrew/homebrew-bundle
tap "homebrew/bundle"
# tap "homebrew/cask"
tap "homebrew/core"
tap "shopify/shopify"
tap "tobi/try", "https://github.com/tobi/try"
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "ctags"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "neovim"
brew "perl"
brew "pinentry-mac" if OS.mac?
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rtk"
brew "rust"
brew "terminal-notifier" if OS.mac?
brew "tig"
brew "tmux"
brew "tree"
brew "try"
brew "vim"
brew "shopify/shopify/ejson" if OS.mac?
brew "shopify/shopify/shopify-cli" if OS.mac?
cask "wezterm"
cask "ghostty"
cask "keycastr" if OS.mac?
cask "raycast" if OS.mac?
cask "shortcat" if OS.mac?
